; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing )
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        
      )
  )

)

; problem
;; vehicles=4, packages=8, locations=11, density=0.5454545454545454, fully_connected=False, max_capacity=2, out_folder=./dense/training, instance_id=51, seed=92

(define (problem transport-51)
 (:domain transport)
 (:objects 
    v1 v2 v3 v4 - vehicle
    p1 p2 p3 p4 p5 p6 p7 p8 - package
    l1 l2 l3 l4 l5 l6 l7 l8 l9 l10 l11 - location
    c0 c1 c2 - size
    )
 (:init (capacity v1 c2)
    (capacity v2 c2)
    (capacity v3 c1)
    (capacity v4 c2)
    (capacity-predecessor c0 c1)
    (capacity-predecessor c1 c2)
    (at p1 l3)
    (at p2 l2)
    (at p3 l10)
    (at p4 l11)
    (at p5 l11)
    (at p6 l6)
    (at p7 l1)
    (at p8 l1)
    (at v1 l1)
    (at v2 l11)
    (at v3 l11)
    (at v4 l3)
    (road l5 l4)
    (road l9 l2)
    (road l9 l5)
    (road l9 l11)
    (road l1 l6)
    (road l4 l5)
    (road l3 l9)
    (road l5 l9)
    (road l9 l7)
    (road l8 l5)
    (road l6 l1)
    (road l1 l8)
    (road l7 l9)
    (road l9 l3)
    (road l5 l8)
    (road l8 l1)
    (road l11 l9)
    (road l10 l1)
    (road l2 l9)
    (road l1 l10)
    (road l3 l6)
    (road l6 l3)
    (road l7 l11)
    (road l11 l7)
    (road l3 l5)
    (road l5 l3)
    (road l6 l9)
    (road l9 l6)
    (road l1 l3)
    (road l3 l1)
    (road l6 l8)
    (road l8 l6)
    (road l3 l10)
    (road l10 l3)
    (road l8 l10)
    (road l10 l8)
    (road l1 l9)
    (road l9 l1)
    (road l7 l8)
    (road l8 l7)
    (road l8 l11)
    (road l11 l8)
    (road l2 l3)
    (road l3 l2)
    (road l2 l10)
    (road l10 l2)
    (road l2 l4)
    (road l4 l2)
    (road l6 l7)
    (road l7 l6)
    (road l9 l10)
    (road l10 l9)
    (road l4 l11)
    (road l11 l4)
    (road l4 l9)
    (road l9 l4)
    (road l4 l10)
    (road l10 l4)
    (road l5 l7)
    (road l7 l5)
    )
 (:goal  (and 
    (at p1 l2)
    (at p2 l3)
    (at p3 l9)
    (at p4 l6)
    (at p5 l9)
    (at p6 l2)
    (at p7 l9)
    (at p8 l2))))

; plan
1. (pick-up v2 l11 p5 c1 c2)
   deleted: (at p5 l11) (capacity v2 c2)
   added: (in p5 v2) (capacity v2 c1)
   goals met: 0 of 8
2. (pick-up v1 l1 p7 c1 c2)
   deleted: (at p7 l1) (capacity v1 c2)
   added: (in p7 v1) (capacity v1 c1)
   goals met: 0 of 8
3. (pick-up v2 l11 p4 c0 c1)
   deleted: (at p4 l11) (capacity v2 c1)
   added: (in p4 v2) (capacity v2 c0)
   goals met: 0 of 8
4. (drive v2 l11 l9)
   deleted: (at v2 l11)
   added: (at v2 l9)
   goals met: 0 of 8
5. (drop v2 l9 p5 c0 c1)
   deleted: (in p5 v2) (capacity v2 c0)
   added: (at p5 l9) (capacity v2 c1)
   goals met: 1 of 8
6. (drive v2 l9 l6)
   deleted: (at v2 l9)
   added: (at v2 l6)
   goals met: 1 of 8
7. (drop v2 l6 p4 c1 c2)
   deleted: (in p4 v2) (capacity v2 c1)
   added: (at p4 l6) (capacity v2 c2)
   goals met: 2 of 8
8. (pick-up v2 l6 p6 c1 c2)
   deleted: (at p6 l6) (capacity v2 c2)
   added: (in p6 v2) (capacity v2 c1)
   goals met: 2 of 8
9. (drive v2 l6 l3)
   deleted: (at v2 l6)
   added: (at v2 l3)
   goals met: 2 of 8
10. (pick-up v2 l3 p1 c0 c1)
   deleted: (at p1 l3) (capacity v2 c1)
   added: (in p1 v2) (capacity v2 c0)
   goals met: 2 of 8
11. (drive v2 l3 l2)
   deleted: (at v2 l3)
   added: (at v2 l2)
   goals met: 2 of 8
12. (drop v2 l2 p1 c0 c1)
   deleted: (in p1 v2) (capacity v2 c0)
   added: (at p1 l2) (capacity v2 c1)
   goals met: 3 of 8
13. (drop v2 l2 p6 c1 c2)
   deleted: (in p6 v2) (capacity v2 c1)
   added: (at p6 l2) (capacity v2 c2)
   goals met: 4 of 8
14. (pick-up v2 l2 p2 c1 c2)
   deleted: (at p2 l2) (capacity v2 c2)
   added: (in p2 v2) (capacity v2 c1)
   goals met: 4 of 8
15. (drive v2 l2 l3)
   deleted: (at v2 l2)
   added: (at v2 l3)
   goals met: 4 of 8
16. (drop v2 l3 p2 c1 c2)
   deleted: (in p2 v2) (capacity v2 c1)
   added: (at p2 l3) (capacity v2 c2)
   goals met: 5 of 8
17. (pick-up v1 l1 p8 c0 c1)
   deleted: (at p8 l1) (capacity v1 c1)
   added: (in p8 v1) (capacity v1 c0)
   goals met: 5 of 8
18. (drive v1 l1 l9)
   deleted: (at v1 l1)
   added: (at v1 l9)
   goals met: 5 of 8
19. (drop v1 l9 p7 c0 c1)
   deleted: (in p7 v1) (capacity v1 c0)
   added: (at p7 l9) (capacity v1 c1)
   goals met: 6 of 8
20. (drive v2 l3 l10)
   deleted: (at v2 l3)
   added: (at v2 l10)
   goals met: 6 of 8
21. (drive v1 l9 l2)
   deleted: (at v1 l9)
   added: (at v1 l2)
   goals met: 6 of 8
22. (drop v1 l2 p8 c1 c2)
   deleted: (in p8 v1) (capacity v1 c1)
   added: (at p8 l2) (capacity v1 c2)
   goals met: 7 of 8
23. (pick-up v2 l10 p3 c1 c2)
   deleted: (at p3 l10) (capacity v2 c2)
   added: (in p3 v2) (capacity v2 c1)
   goals met: 7 of 8
24. (drive v2 l10 l9)
   deleted: (at v2 l10)
   added: (at v2 l9)
   goals met: 7 of 8
25. (drop v2 l9 p3 c1 c2)
   deleted: (in p3 v2) (capacity v2 c1)
   added: (at p3 l9) (capacity v2 c2)
   goals met: 8 of 8
